lucasccordeiro/NVIDIA-OpenSMA/src/boards/mcxn547helloworld/trustzone/resource_config.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: TEE v10.0
processor: MCXN547
package_id: MCXN547VDF
mcu_data: ksdk2_0
processor_version: 25.09.10
toolOptions:
  _output_type_: c_code
  _legacy_source_names_: 'no'
  _resilient_code_reg_writes_: 'no'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

/***********************************************************************************************************************
 * Included files
 **********************************************************************************************************************/
#include "fsl_common.h"
#include "resource_config.h"

/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
functional_group:
- called_from_default_init: 'true'
- id_prefix: 'BOARD_INITTEE_'
- prefix_user_defined: 'false'
- name: 'BOARD_InitTEE'
- description: ''
- ahbsc_rwx:
  - interrupts:
    - masking: {Non-masked: {id: [ADC0_IRQn, ADC1_IRQn, CAN0_IRQn, CDOG0_IRQn, CDOG1_IRQn, CMC0_IRQn, CTI0_IRQn, CTIMER0_IRQn, CTIMER1_IRQn, CTIMER2_IRQn, CTIMER3_IRQn,
          CTIMER4_IRQn, DAC0_IRQn, EDMA_0_CH0_IRQn, EDMA_0_CH10_IRQn, EDMA_0_CH11_IRQn, EDMA_0_CH12_IRQn, EDMA_0_CH13_IRQn, EDMA_0_CH14_IRQn, EDMA_0_CH15_IRQn, EDMA_0_CH1_IRQn,
          EDMA_0_CH2_IRQn, EDMA_0_CH3_IRQn, EDMA_0_CH4_IRQn, EDMA_0_CH5_IRQn, EDMA_0_CH6_IRQn, EDMA_0_CH7_IRQn, EDMA_0_CH8_IRQn, EDMA_0_CH9_IRQn, EDMA_1_CH0_IRQn,
          EDMA_1_CH10_IRQn, EDMA_1_CH11_IRQn, EDMA_1_CH12_IRQn, EDMA_1_CH13_IRQn, EDMA_1_CH14_IRQn, EDMA_1_CH153_IRQn, EDMA_1_CH1_IRQn, EDMA_1_CH2_IRQn, EDMA_1_CH3_IRQn,
          EDMA_1_CH4_IRQn, EDMA_1_CH5_IRQn, EDMA_1_CH6_IRQn, EDMA_1_CH7_IRQn, EDMA_1_CH8_IRQn, EDMA_1_CH9_IRQn, ELS_ERR_IRQn, ELS_IRQn, EMVSIM0_IRQn, EMVSIM1_IRQn,
          ERM_MULTI_BIT_ERROR_IRQn, ERM_SINGLE_BIT_ERROR_IRQn, ETB0_IRQn, ETHERNET_IRQn, ETHERNET_MACLP_IRQn, ETHERNET_PMT_IRQn, EWM0_IRQn, FLEXIO_IRQn, FLEXPWM0_FAULT_IRQn,
          FLEXPWM0_RELOAD_ERROR_IRQn, FLEXPWM0_SUBMODULE0_IRQn, FLEXPWM0_SUBMODULE1_IRQn, FLEXPWM0_SUBMODULE2_IRQn, FLEXPWM0_SUBMODULE3_IRQn, FLEXSPI0_IRQn, FMU0_IRQn,
          Freqme_IRQn, GDET_IRQn, GPIO00_IRQn, GPIO01_IRQn, GPIO10_IRQn, GPIO11_IRQn, GPIO20_IRQn, GPIO21_IRQn, GPIO30_IRQn, GPIO31_IRQn, GPIO40_IRQn, GPIO41_IRQn,
          GPIO50_IRQn, GPIO51_IRQn, HSCMP0_IRQn, HSCMP1_IRQn, I3C0_IRQn, I3C1_IRQn, ITRC0_IRQn, LPTMR0_IRQn, LPTMR1_IRQn, LP_FLEXCOMM0_IRQn, LP_FLEXCOMM1_IRQn, LP_FLEXCOMM2_IRQn,
          LP_FLEXCOMM3_IRQn, LP_FLEXCOMM4_IRQn, LP_FLEXCOMM5_IRQn, LP_FLEXCOMM6_IRQn, LP_FLEXCOMM7_IRQn, LP_FLEXCOMM8_IRQn, LP_FLEXCOMM9_IRQn, MAILBOX_IRQn, MRT0_IRQn,
          NPU_IRQn, OR_IRQn, OS_EVENT_IRQn, PDM_EVENT_IRQn, PINT0_IRQn, PKC_ERR_IRQn, PKC_IRQn, PLU_IRQn, PORT_EFT_IRQn, PQ_IRQn, PUF_IRQn, QDC0_COMPARE_IRQn, QDC0_HOME_IRQn,
          QDC0_IDX_IRQn, QDC0_WDG_SAB_IRQn, RTC_IRQn, SAI0_IRQn, SAI1_IRQn, SCG_IRQn, SCT0_IRQn, SEC_HYPERVISOR_CALL_IRQn, SEC_VIO_IRQn, SMARTDMA_IRQn, SPC_IRQn,
          TSI_END_OF_SCAN_IRQn, TSI_OUT_OF_SCAN_IRQn, USB0_DCD_IRQn, USB0_FS_IRQn, USB1_HS_IRQn, USB1_HS_PHY_IRQn, USDHC0_IRQn, UTICK0_IRQn, VBAT0_IRQn, WUU_IRQn,
          WWDT0_IRQn, WWDT1_IRQn]}}
    - security: {Secure: {id: [ADC0_IRQn, ADC1_IRQn, CAN0_IRQn, CDOG0_IRQn, CDOG1_IRQn, CMC0_IRQn, CTI0_IRQn, CTIMER0_IRQn, CTIMER1_IRQn, CTIMER2_IRQn, CTIMER3_IRQn,
          CTIMER4_IRQn, DAC0_IRQn, EDMA_0_CH0_IRQn, EDMA_0_CH10_IRQn, EDMA_0_CH11_IRQn, EDMA_0_CH12_IRQn, EDMA_0_CH13_IRQn, EDMA_0_CH14_IRQn, EDMA_0_CH15_IRQn, EDMA_0_CH1_IRQn,
          EDMA_0_CH2_IRQn, EDMA_0_CH3_IRQn, EDMA_0_CH4_IRQn, EDMA_0_CH5_IRQn, EDMA_0_CH6_IRQn, EDMA_0_CH7_IRQn, EDMA_0_CH8_IRQn, EDMA_0_CH9_IRQn, EDMA_1_CH0_IRQn,
          EDMA_1_CH10_IRQn, EDMA_1_CH11_IRQn, EDMA_1_CH12_IRQn, EDMA_1_CH13_IRQn, EDMA_1_CH14_IRQn, EDMA_1_CH153_IRQn, EDMA_1_CH1_IRQn, EDMA_1_CH2_IRQn, EDMA_1_CH3_IRQn,
          EDMA_1_CH4_IRQn, EDMA_1_CH5_IRQn, EDMA_1_CH6_IRQn, EDMA_1_CH7_IRQn, EDMA_1_CH8_IRQn, EDMA_1_CH9_IRQn, ELS_ERR_IRQn, ELS_IRQn, EMVSIM0_IRQn, EMVSIM1_IRQn,
          ERM_MULTI_BIT_ERROR_IRQn, ERM_SINGLE_BIT_ERROR_IRQn, ETB0_IRQn, ETHERNET_IRQn, ETHERNET_MACLP_IRQn, ETHERNET_PMT_IRQn, EWM0_IRQn, FLEXIO_IRQn, FLEXPWM0_FAULT_IRQn,
          FLEXPWM0_RELOAD_ERROR_IRQn, FLEXPWM0_SUBMODULE0_IRQn, FLEXPWM0_SUBMODULE1_IRQn, FLEXPWM0_SUBMODULE2_IRQn, FLEXPWM0_SUBMODULE3_IRQn, FLEXSPI0_IRQn, FMU0_IRQn,
          Freqme_IRQn, GDET_IRQn, GPIO00_IRQn, GPIO01_IRQn, GPIO10_IRQn, GPIO11_IRQn, GPIO20_IRQn, GPIO21_IRQn, GPIO30_IRQn, GPIO31_IRQn, GPIO40_IRQn, GPIO41_IRQn,
          GPIO50_IRQn, GPIO51_IRQn, HSCMP0_IRQn, HSCMP1_IRQn, I3C0_IRQn, I3C1_IRQn, ITRC0_IRQn, LPTMR0_IRQn, LPTMR1_IRQn, LP_FLEXCOMM0_IRQn, LP_FLEXCOMM1_IRQn, LP_FLEXCOMM2_IRQn,
          LP_FLEXCOMM3_IRQn, LP_FLEXCOMM4_IRQn, LP_FLEXCOMM5_IRQn, LP_FLEXCOMM6_IRQn, LP_FLEXCOMM7_IRQn, LP_FLEXCOMM8_IRQn, LP_FLEXCOMM9_IRQn, MAILBOX_IRQn, MRT0_IRQn,
          NPU_IRQn, OR_IRQn, OS_EVENT_IRQn, PDM_EVENT_IRQn, PINT0_IRQn, PKC_ERR_IRQn, PKC_IRQn, PLU_IRQn, PORT_EFT_IRQn, PQ_IRQn, PUF_IRQn, QDC0_COMPARE_IRQn, QDC0_HOME_IRQn,
          QDC0_IDX_IRQn, QDC0_WDG_SAB_IRQn, RTC_IRQn, SAI0_IRQn, SAI1_IRQn, SCG_IRQn, SCT0_IRQn, SEC_HYPERVISOR_CALL_IRQn, SEC_VIO_IRQn, SMARTDMA_IRQn, SPC_IRQn,
          TSI_END_OF_SCAN_IRQn, TSI_OUT_OF_SCAN_IRQn, USB0_DCD_IRQn, USB0_FS_IRQn, USB1_HS_IRQn, USB1_HS_PHY_IRQn, USDHC0_IRQn, UTICK0_IRQn, VBAT0_IRQn, WUU_IRQn,
          WWDT0_IRQn, WWDT1_IRQn]}}
  - ports:
    - GPIO0: {pin_security: {id: '0', security: s_priv}, pin_security: {id: '1', security: s_priv}, pin_security: {id: '10', security: s_priv}, pin_security: {
        id: '11', security: s_priv}, pin_security: {id: '12', security: s_priv}, pin_security: {id: '13', security: s_priv}, pin_security: {id: '14', security: s_priv},
      pin_security: {id: '15', security: s_priv}, pin_security: {id: '16', security: s_priv}, pin_security: {id: '17', security: s_priv}, pin_security: {id: '18',
        security: s_priv}, pin_security: {id: '19', security: s_priv}, pin_security: {id: '2', security: s_priv}, pin_security: {id: '20', security: s_priv}, pin_security: {
        id: '21', security: s_priv}, pin_security: {id: '22', security: s_priv}, pin_security: {id: '23', security: s_priv}, pin_security: {id: '24', security: s_priv},
      pin_security: {id: '25', security: s_priv}, pin_security: {id: '26', security: s_priv}, pin_security: {id: '27', security: s_priv}, pin_security: {id: '28',
        security: s_priv}, pin_security: {id: '29', security: s_priv}, pin_security: {id: '3', security: s_priv}, pin_security: {id: '30', security: s_priv}, pin_security: {
        id: '31', security: s_priv}, pin_security: {id: '4', security: s_priv}, pin_security: {id: '5', security: s_priv}, pin_security: {id: '6', security: s_priv},
      pin_security: {id: '7', security: s_priv}, pin_security: {id: '8', security: s_priv}, pin_security: {id: '9', security: s_priv}, pin_interrupt_security: {id: '0',
        security: s_priv}, pin_interrupt_security: {id: '1', security: s_priv}}
    - GPIO1: {pin_security: {id: '0', security: s_priv}, pin_security: {id: '1', security: s_priv}, pin_security: {id: '10', security: s_priv}, pin_security: {
        id: '11', security: s_priv}, pin_security: {id: '12', security: s_priv}, pin_security: {id: '13', security: s_priv}, pin_security: {id: '14', security: s_priv},
      pin_security: {id: '15', security: s_priv}, pin_security: {id: '16', security: s_priv}, pin_security: {id: '17', security: s_priv}, pin_security: {id: '18',
        security: s_priv}, pin_security: {id: '19', security: s_priv}, pin_security: {id: '2', security: s_priv}, pin_security: {id: '20', security: s_priv}, pin_security: {
        id: '21', security: s_priv}, pin_security: {id: '22', security: s_priv}, pin_security: {id: '23', security: s_priv}, pin_security: {id: '3', security: s_priv},
      pin_security: {id: '30', security: s_priv}, pin_security: {id: '31', security: s_priv}, pin_security: {id: '4', security: s_priv}, pin_security: {id: '5', security: s_priv},
      pin_security: {id: '6', security: s_priv}, pin_security: {id: '7', security: s_priv}, pin_security: {id: '8', security: s_priv}, pin_security: {id: '9', security: s_priv},
      pin_interrupt_security: {id: '0', security: s_priv}, pin_interrupt_security: {id: '1', security: s_priv}}
    - GPIO2: {pin_security: {id: '0', security: s_priv}, pin_security: {id: '1', security: s_priv}, pin_security: {id: '10', security: s_priv}, pin_security: {
        id: '11', security: s_priv}, pin_security: {id: '2', security: s_priv}, pin_security: {id: '3', security: s_priv}, pin_security: {id: '4', security: s_priv},
      pin_security: {id: '5', security: s_priv}, pin_security: {id: '6', security: s_priv}, pin_security: {id: '7', security: s_priv}, pin_security: {id: '8', security: s_priv},
      pin_security: {id: '9', security: s_priv}, pin_interrupt_security: {id: '0', security: s_priv}, pin_interrupt_security: {id: '1', security: s_priv}}
    - GPIO3: {pin_security: {id: '0', security: s_priv}, pin_security: {id: '1', security: s_priv}, pin_security: {id: '10', security: s_priv}, pin_security: {
        id: '11', security: s_priv}, pin_security: {id: '12', security: s_priv}, pin_security: {id: '13', security: s_priv}, pin_security: {id: '14', security: s_priv},
      pin_security: {id: '15', security: s_priv}, pin_security: {id: '16', security: s_priv}, pin_security: {id: '17', security: s_priv}, pin_security: {id: '18',
        security: s_priv}, pin_security: {id: '19', security: s_priv}, pin_security: {id: '2', security: s_priv}, pin_security: {id: '20', security: s_priv}, pin_security: {
        id: '21', security: s_priv}, pin_security: {id: '22', security: s_priv}, pin_security: {id: '23', security: s_priv}, pin_security: {id: '3', security: s_priv},
      pin_security: {id: '4', security: s_priv}, pin_security: {id: '5', security: s_priv}, pin_security: {id: '6', security: s_priv}, pin_security: {id: '7', security: s_priv},
      pin_security: {id: '8', security: s_priv}, pin_security: {id: '9', security: s_priv}, pin_interrupt_security: {id: '0', security: s_priv}, pin_interrupt_security: {
        id: '1', security: s_priv}}
    - GPIO4: {pin_security: {id: '0', security: s_priv}, pin_security: {id: '1', security: s_priv}, pin_security: {id: '12', security: s_priv}, pin_security: {
        id: '13', security: s_priv}, pin_security: {id: '14', security: s_priv}, pin_security: {id: '15', security: s_priv}, pin_security: {id: '16', security: s_priv},
      pin_security: {id: '17', security: s_priv}, pin_security: {id: '18', security: s_priv}, pin_security: {id: '19', security: s_priv}, pin_security: {id: '2',
        security: s_priv}, pin_security: {id: '20', security: s_priv}, pin_security: {id: '21', security: s_priv}, pin_security: {id: '22', security: s_priv}, pin_security: {
        id: '23', security: s_priv}, pin_security: {id: '3', security: s_priv}, pin_security: {id: '4', security: s_priv}, pin_security: {id: '5', security: s_priv},
      pin_security: {id: '6', security: s_priv}, pin_security: {id: '7', security: s_priv}, pin_interrupt_security: {id: '0', security: s_priv}, pin_interrupt_security: {
        id: '1', security: s_priv}}
    - GPIO5: {pin_security: {id: '0', security: s_priv}, pin_security: {id: '1', security: s_priv}, pin_security: {id: '2', security: s_priv}, pin_security: {id: '3',
        security: s_priv}, pin_security: {id: '4', security: s_priv}, pin_security: {id: '5', security: s_priv}, pin_security: {id: '6', security: s_priv}, pin_security: {
        id: '7', security: s_priv}, pin_security: {id: '8', security: s_priv}, pin_security: {id: '9', security: s_priv}, pin_interrupt_security: {id: '0', security: s_priv},
      pin_interrupt_security: {id: '1', security: s_priv}}
    - pio0: {Non-masked: {id: ['0', '1', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '2', '20', '21', '22', '23', '24', '25', '26', '27', '28',
          '29', '3', '30', '31', '4', '5', '6', '7', '8', '9']}}
    - pio1: {Non-masked: {id: ['0', '1', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '2', '20', '21', '22', '23', '3', '30', '31', '4', '5', '6',
          '7', '8', '9']}}
  - triggers:
    - 0: {triggers_input: {id: input_0, selected: 'false', writable: 'true'}, triggers_input: {id: input_1, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_2, selected: 'false', writable: 'true'}, triggers_input: {id: input_3, selected: 'false', writable: 'true'}, triggers_input: {id: input_4, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_5, selected: 'false', writable: 'true'}, triggers_input: {id: input_6, selected: 'false', writable: 'true'},
      triggers_input: {id: input_7, selected: 'false', writable: 'true'}, triggers_input: {id: input_8, selected: 'false', writable: 'true'}, triggers_input: {id: input_9,
        selected: 'false', writable: 'true'}, triggers_input: {id: input_10, selected: 'false', writable: 'true'}, triggers_input: {id: input_11, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_12, selected: 'false', writable: 'true'}, triggers_input: {id: input_13, selected: 'false', writable: 'true'},
      triggers_input: {id: input_14, selected: 'false', writable: 'true'}, triggers_input: {id: input_15, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_16, selected: 'false', writable: 'true'}, triggers_input: {id: input_17, selected: 'false', writable: 'true'}, triggers_input: {id: input_19, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_20, selected: 'false', writable: 'true'}, triggers_input: {id: input_21, selected: 'false', writable: 'true'},
      triggers_input: {id: input_22, selected: 'false', writable: 'true'}, triggers_input: {id: input_23, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_24, selected: 'false', writable: 'true'}, triggers_input: {id: input_25, selected: 'false', writable: 'true'}, triggers_input: {id: input_26, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_27, selected: 'false', writable: 'true'}, triggers_input: {id: input_28, selected: 'false', writable: 'true'},
      triggers_input: {id: input_29, selected: 'false', writable: 'true'}, triggers_input: {id: input_30, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_31, selected: 'false', writable: 'true'}, triggers_input: {id: input_32, selected: 'false', writable: 'true'}, triggers_input: {id: input_33, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_34, selected: 'false', writable: 'true'}, triggers_input: {id: input_35, selected: 'false', writable: 'true'},
      triggers_input: {id: input_36, selected: 'false', writable: 'true'}, triggers_input: {id: input_37, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_46, selected: 'false', writable: 'true'}, triggers_input: {id: input_47, selected: 'false', writable: 'true'}}
    - 1: {triggers_input: {id: input_0, selected: 'false', writable: 'true'}, triggers_input: {id: input_1, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_2, selected: 'false', writable: 'true'}, triggers_input: {id: input_3, selected: 'false', writable: 'true'}, triggers_input: {id: input_4, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_5, selected: 'false', writable: 'true'}, triggers_input: {id: input_6, selected: 'false', writable: 'true'},
      triggers_input: {id: input_7, selected: 'false', writable: 'true'}, triggers_input: {id: input_8, selected: 'false', writable: 'true'}, triggers_input: {id: input_9,
        selected: 'false', writable: 'true'}, triggers_input: {id: input_10, selected: 'false', writable: 'true'}, triggers_input: {id: input_11, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_12, selected: 'false', writable: 'true'}, triggers_input: {id: input_13, selected: 'false', writable: 'true'},
      triggers_input: {id: input_14, selected: 'false', writable: 'true'}, triggers_input: {id: input_15, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_16, selected: 'false', writable: 'true'}, triggers_input: {id: input_17, selected: 'false', writable: 'true'}, triggers_input: {id: input_19, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_20, selected: 'false', writable: 'true'}, triggers_input: {id: input_21, selected: 'false', writable: 'true'},
      triggers_input: {id: input_22, selected: 'false', writable: 'true'}, triggers_input: {id: input_23, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_24, selected: 'false', writable: 'true'}, triggers_input: {id: input_25, selected: 'false', writable: 'true'}, triggers_input: {id: input_26, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_27, selected: 'false', writable: 'true'}, triggers_input: {id: input_28, selected: 'false', writable: 'true'},
      triggers_input: {id: input_29, selected: 'false', writable: 'true'}, triggers_input: {id: input_30, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_31, selected: 'false', writable: 'true'}, triggers_input: {id: input_32, selected: 'false', writable: 'true'}, triggers_input: {id: input_33, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_34, selected: 'false', writable: 'true'}, triggers_input: {id: input_35, selected: 'false', writable: 'true'},
      triggers_input: {id: input_36, selected: 'false', writable: 'true'}, triggers_input: {id: input_37, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_46, selected: 'false', writable: 'true'}, triggers_input: {id: input_47, selected: 'false', writable: 'true'}}
    - 2: {triggers_input: {id: input_0, selected: 'false', writable: 'true'}, triggers_input: {id: input_1, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_2, selected: 'false', writable: 'true'}, triggers_input: {id: input_3, selected: 'false', writable: 'true'}, triggers_input: {id: input_4, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_5, selected: 'false', writable: 'true'}, triggers_input: {id: input_6, selected: 'false', writable: 'true'},
      triggers_input: {id: input_7, selected: 'false', writable: 'true'}, triggers_input: {id: input_8, selected: 'false', writable: 'true'}, triggers_input: {id: input_9,
        selected: 'false', writable: 'true'}, triggers_input: {id: input_10, selected: 'false', writable: 'true'}, triggers_input: {id: input_11, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_12, selected: 'false', writable: 'true'}, triggers_input: {id: input_13, selected: 'false', writable: 'true'},
      triggers_input: {id: input_14, selected: 'false', writable: 'true'}, triggers_input: {id: input_15, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_16, selected: 'false', writable: 'true'}, triggers_input: {id: input_17, selected: 'false', writable: 'true'}, triggers_input: {id: input_19, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_20, selected: 'false', writable: 'true'}, triggers_input: {id: input_21, selected: 'false', writable: 'true'},
      triggers_input: {id: input_22, selected: 'false', writable: 'true'}, triggers_input: {id: input_23, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_24, selected: 'false', writable: 'true'}, triggers_input: {id: input_25, selected: 'false', writable: 'true'}, triggers_input: {id: input_26, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_27, selected: 'false', writable: 'true'}, triggers_input: {id: input_28, selected: 'false', writable: 'true'},
      triggers_input: {id: input_29, selected: 'false', writable: 'true'}, triggers_input: {id: input_30, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_31, selected: 'false', writable: 'true'}, triggers_input: {id: input_32, selected: 'false', writable: 'true'}, triggers_input: {id: input_33, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_34, selected: 'false', writable: 'true'}, triggers_input: {id: input_35, selected: 'false', writable: 'true'},
      triggers_input: {id: input_36, selected: 'false', writable: 'true'}, triggers_input: {id: input_37, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_46, selected: 'false', writable: 'true'}, triggers_input: {id: input_47, selected: 'false', writable: 'true'}}
    - 3: {triggers_input: {id: input_0, selected: 'false', writable: 'true'}, triggers_input: {id: input_1, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_2, selected: 'false', writable: 'true'}, triggers_input: {id: input_3, selected: 'false', writable: 'true'}, triggers_input: {id: input_4, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_5, selected: 'false', writable: 'true'}, triggers_input: {id: input_6, selected: 'false', writable: 'true'},
      triggers_input: {id: input_7, selected: 'false', writable: 'true'}, triggers_input: {id: input_8, selected: 'false', writable: 'true'}, triggers_input: {id: input_9,
        selected: 'false', writable: 'true'}, triggers_input: {id: input_10, selected: 'false', writable: 'true'}, triggers_input: {id: input_11, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_12, selected: 'false', writable: 'true'}, triggers_input: {id: input_13, selected: 'false', writable: 'true'},
      triggers_input: {id: input_14, selected: 'false', writable: 'true'}, triggers_input: {id: input_15, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_16, selected: 'false', writable: 'true'}, triggers_input: {id: input_17, selected: 'false', writable: 'true'}, triggers_input: {id: input_19, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_20, selected: 'false', writable: 'true'}, triggers_input: {id: input_21, selected: 'false', writable: 'true'},
      triggers_input: {id: input_22, selected: 'false', writable: 'true'}, triggers_input: {id: input_23, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_24, selected: 'false', writable: 'true'}, triggers_input: {id: input_25, selected: 'false', writable: 'true'}, triggers_input: {id: input_26, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_27, selected: 'false', writable: 'true'}, triggers_input: {id: input_28, selected: 'false', writable: 'true'},
      triggers_input: {id: input_29, selected: 'false', writable: 'true'}, triggers_input: {id: input_30, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_31, selected: 'false', writable: 'true'}, triggers_input: {id: input_32, selected: 'false', writable: 'true'}, triggers_input: {id: input_33, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_34, selected: 'false', writable: 'true'}, triggers_input: {id: input_35, selected: 'false', writable: 'true'},
      triggers_input: {id: input_36, selected: 'false', writable: 'true'}, triggers_input: {id: input_37, selected: 'false', writable: 'true'}, triggers_input: {
