lucasccordeiro/NVIDIA-OpenSMA/src/boards/mcxn547helloworld/trustzone/resource_config.c
        id: input_46, selected: 'false', writable: 'true'}, triggers_input: {id: input_47, selected: 'false', writable: 'true'}}
    - 4: {triggers_input: {id: input_0, selected: 'false', writable: 'true'}, triggers_input: {id: input_1, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_2, selected: 'false', writable: 'true'}, triggers_input: {id: input_3, selected: 'false', writable: 'true'}, triggers_input: {id: input_4, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_5, selected: 'false', writable: 'true'}, triggers_input: {id: input_6, selected: 'false', writable: 'true'},
      triggers_input: {id: input_7, selected: 'false', writable: 'true'}, triggers_input: {id: input_8, selected: 'false', writable: 'true'}, triggers_input: {id: input_9,
        selected: 'false', writable: 'true'}, triggers_input: {id: input_10, selected: 'false', writable: 'true'}, triggers_input: {id: input_11, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_12, selected: 'false', writable: 'true'}, triggers_input: {id: input_13, selected: 'false', writable: 'true'},
      triggers_input: {id: input_14, selected: 'false', writable: 'true'}, triggers_input: {id: input_15, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_16, selected: 'false', writable: 'true'}, triggers_input: {id: input_17, selected: 'false', writable: 'true'}, triggers_input: {id: input_19, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_20, selected: 'false', writable: 'true'}, triggers_input: {id: input_21, selected: 'false', writable: 'true'},
      triggers_input: {id: input_22, selected: 'false', writable: 'true'}, triggers_input: {id: input_23, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_24, selected: 'false', writable: 'true'}, triggers_input: {id: input_25, selected: 'false', writable: 'true'}, triggers_input: {id: input_26, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_27, selected: 'false', writable: 'true'}, triggers_input: {id: input_28, selected: 'false', writable: 'true'},
      triggers_input: {id: input_29, selected: 'false', writable: 'true'}, triggers_input: {id: input_30, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_31, selected: 'false', writable: 'true'}, triggers_input: {id: input_32, selected: 'false', writable: 'true'}, triggers_input: {id: input_33, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_34, selected: 'false', writable: 'true'}, triggers_input: {id: input_35, selected: 'false', writable: 'true'},
      triggers_input: {id: input_36, selected: 'false', writable: 'true'}, triggers_input: {id: input_37, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_46, selected: 'false', writable: 'true'}, triggers_input: {id: input_47, selected: 'false', writable: 'true'}}
    - 5: {triggers_input: {id: input_0, selected: 'false', writable: 'true'}, triggers_input: {id: input_1, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_2, selected: 'false', writable: 'true'}, triggers_input: {id: input_3, selected: 'false', writable: 'true'}, triggers_input: {id: input_4, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_5, selected: 'false', writable: 'true'}, triggers_input: {id: input_6, selected: 'false', writable: 'true'},
      triggers_input: {id: input_7, selected: 'false', writable: 'true'}, triggers_input: {id: input_8, selected: 'false', writable: 'true'}, triggers_input: {id: input_9,
        selected: 'false', writable: 'true'}, triggers_input: {id: input_10, selected: 'false', writable: 'true'}, triggers_input: {id: input_11, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_12, selected: 'false', writable: 'true'}, triggers_input: {id: input_13, selected: 'false', writable: 'true'},
      triggers_input: {id: input_14, selected: 'false', writable: 'true'}, triggers_input: {id: input_15, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_16, selected: 'false', writable: 'true'}, triggers_input: {id: input_17, selected: 'false', writable: 'true'}, triggers_input: {id: input_19, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_20, selected: 'false', writable: 'true'}, triggers_input: {id: input_21, selected: 'false', writable: 'true'},
      triggers_input: {id: input_22, selected: 'false', writable: 'true'}, triggers_input: {id: input_23, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_24, selected: 'false', writable: 'true'}, triggers_input: {id: input_25, selected: 'false', writable: 'true'}, triggers_input: {id: input_26, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_27, selected: 'false', writable: 'true'}, triggers_input: {id: input_28, selected: 'false', writable: 'true'},
      triggers_input: {id: input_29, selected: 'false', writable: 'true'}, triggers_input: {id: input_30, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_31, selected: 'false', writable: 'true'}, triggers_input: {id: input_32, selected: 'false', writable: 'true'}, triggers_input: {id: input_33, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_34, selected: 'false', writable: 'true'}, triggers_input: {id: input_35, selected: 'false', writable: 'true'},
      triggers_input: {id: input_36, selected: 'false', writable: 'true'}, triggers_input: {id: input_37, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_46, selected: 'false', writable: 'true'}, triggers_input: {id: input_47, selected: 'false', writable: 'true'}}
    - 6: {triggers_input: {id: input_0, selected: 'false', writable: 'true'}, triggers_input: {id: input_1, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_2, selected: 'false', writable: 'true'}, triggers_input: {id: input_3, selected: 'false', writable: 'true'}, triggers_input: {id: input_4, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_5, selected: 'false', writable: 'true'}, triggers_input: {id: input_6, selected: 'false', writable: 'true'},
      triggers_input: {id: input_7, selected: 'false', writable: 'true'}, triggers_input: {id: input_8, selected: 'false', writable: 'true'}, triggers_input: {id: input_9,
        selected: 'false', writable: 'true'}, triggers_input: {id: input_10, selected: 'false', writable: 'true'}, triggers_input: {id: input_11, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_12, selected: 'false', writable: 'true'}, triggers_input: {id: input_13, selected: 'false', writable: 'true'},
      triggers_input: {id: input_14, selected: 'false', writable: 'true'}, triggers_input: {id: input_15, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_16, selected: 'false', writable: 'true'}, triggers_input: {id: input_17, selected: 'false', writable: 'true'}, triggers_input: {id: input_19, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_20, selected: 'false', writable: 'true'}, triggers_input: {id: input_21, selected: 'false', writable: 'true'},
      triggers_input: {id: input_22, selected: 'false', writable: 'true'}, triggers_input: {id: input_23, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_24, selected: 'false', writable: 'true'}, triggers_input: {id: input_25, selected: 'false', writable: 'true'}, triggers_input: {id: input_26, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_27, selected: 'false', writable: 'true'}, triggers_input: {id: input_28, selected: 'false', writable: 'true'},
      triggers_input: {id: input_29, selected: 'false', writable: 'true'}, triggers_input: {id: input_30, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_31, selected: 'false', writable: 'true'}, triggers_input: {id: input_32, selected: 'false', writable: 'true'}, triggers_input: {id: input_33, selected: 'false',
        writable: 'true'}, triggers_input: {id: input_34, selected: 'false', writable: 'true'}, triggers_input: {id: input_35, selected: 'false', writable: 'true'},
      triggers_input: {id: input_36, selected: 'false', writable: 'true'}, triggers_input: {id: input_37, selected: 'false', writable: 'true'}, triggers_input: {
        id: input_46, selected: 'false', writable: 'true'}, triggers_input: {id: input_47, selected: 'false', writable: 'true'}}
  - regions: [{memory: PROGRAM_FLASH0, security: s_priv, start: '0x00000000', size: '0x00100000'}, {memory: PROGRAM_FLASH1, security: ns_user, start: '0x00000000',
      size: '0x00100000'}, {memory: FlashBank_IFR0, security: s_priv, start: '0x00000000', size: '0x00010000'}, {memory: FlashBank_IFR1, security: s_priv, start: '0x00000000',
      size: '0x00004000'}, {memory: BootROM, security: s_priv, start: '0x00000000', size: '0x00040000'}, {memory: SRAMX, security: s_priv, start: '0x00000000', size: '0x00018000'},
    {memory: SRAMA, security: s_priv, start: '0x00000000', size: '0x00008000'}, {memory: SRAMB, security: s_priv, start: '0x00000000', size: '0x00008000'}, {memory: SRAMC,
      security: s_priv, start: '0x00000000', size: '0x00010000'}, {memory: SRAMD, security: s_priv, start: '0x00000000', size: '0x00010000'}, {memory: SRAME, security: s_priv,
      start: '0x00000000', size: '0x00010000'}, {memory: SRAMF, security: s_priv, start: '0x00000000', size: '0x00010000'}, {memory: SRAMG, security: s_priv, start: '0x00000000',
      size: '0x00010000'}, {memory: SRAMH, security: s_priv, start: '0x00000000', size: '0x00008000'}, {memory: FlexSPI0_0, security: s_priv, start: '0x00000000',
      size: '0x10000000'}, {memory: FlexSPI0_1, security: s_priv, start: '0x00000000', size: '0x10000000'}]
  - masters: {ns_user: {id: [CPU1]}, s_priv: {id: [DMA3_0, DMA3_1, ETHERNET, NPUO, PKC, PQ, SMARTDMA, USB_FS, USDHC]}, ns_priv: {id: [USB_HS]}}
  - peripherals: {ns_user: {id: [ADC0, ADC1, CAN0_RULE0, CAN0_RULE1, CAN0_RULE2, CAN0_RULE3, CDOG0, CTIMER3, DMA0_MP, DMA1_MP, GPIO0_ALIAS1, GPIO1_ALIAS1, GPIO2_ALIAS1,
        GPIO3_ALIAS1, GPIO4_ALIAS1, GPIO5_ALIAS1, MAILBOX, MBC, NPU, OSTIMER0, PKC_RAM, QDC0, SCG0, SFA, SPC0, SYSCON0, TRO0, USBDCD0, USBFS0, USBHS1__USBC, USBPHY,
        USB_RAM]}, s_priv: {id: [AHBSC, AHBSC_ALIAS1, AHBSC_ALIAS2, AHBSC_ALIAS3, CACHE64_POLSEL0, CDOG1, CMP0, CMP1, CMX_PERFMON0, CMX_PERFMON1, CRC0, CTIMER0, CTIMER1,
        CTIMER2, CTIMER4, DAC0, DM0, DMA0_TEE_ALIAS0, DMA0_TEE_ALIAS1, DMA0_TEE_ALIAS10, DMA0_TEE_ALIAS11, DMA0_TEE_ALIAS12, DMA0_TEE_ALIAS13, DMA0_TEE_ALIAS14, DMA0_TEE_ALIAS15,
        DMA0_TEE_ALIAS2, DMA0_TEE_ALIAS3, DMA0_TEE_ALIAS4, DMA0_TEE_ALIAS5, DMA0_TEE_ALIAS6, DMA0_TEE_ALIAS7, DMA0_TEE_ALIAS8, DMA0_TEE_ALIAS9, DMA1_TEE_ALIAS0, DMA1_TEE_ALIAS1,
        DMA1_TEE_ALIAS10, DMA1_TEE_ALIAS11, DMA1_TEE_ALIAS12, DMA1_TEE_ALIAS13, DMA1_TEE_ALIAS14, DMA1_TEE_ALIAS15, DMA1_TEE_ALIAS2, DMA1_TEE_ALIAS3, DMA1_TEE_ALIAS4,
        DMA1_TEE_ALIAS5, DMA1_TEE_ALIAS6, DMA1_TEE_ALIAS7, DMA1_TEE_ALIAS8, DMA1_TEE_ALIAS9, EIM0, ELS, ELS_ALIAS1, ELS_ALIAS2, ELS_ALIAS3, EMVSIM0, EMVSIM1, ENET0,
        ERM0, EVTG0, EWM0, FLEXIO0, FLEXSPI0, FMU0, FREQME0, GDET1, GPIO0, GPIO1, GPIO2, GPIO3, GPIO4, GPIO5, I3C0, I3C1, INPUTMUX0, INTM0, ITRC0, LPTMR0, LPTMR1,
        LP_FLEXCOMM0, LP_FLEXCOMM1, LP_FLEXCOMM2, LP_FLEXCOMM3, LP_FLEXCOMM4, LP_FLEXCOMM5, LP_FLEXCOMM6, LP_FLEXCOMM7, LP_FLEXCOMM8, LP_FLEXCOMM9, MRT0, NPX0, OTPC0,
        PDM, PINT0, PKC0, PLU0, PORT0, PORT1, PORT2, PORT3, PORT4, PORT5, POWERQUAD, PUF, PUF_ALIAS1, PUF_ALIAS2, PUF_ALIAS3, PWM0, RTC0, SAI0, SAI1, SCT0, SEMA42_0,
        SMARTDMA0, TDET0, TSI0, USDHC0, UTICK0, VBAT0, VREF0, WUU0, WWDT0, WWDT1]}}
  - mbcs:
    - mbc:
      - checker_id: 'MBC0'
      - using_global_templates: 'true'
      - slaves: [{id: PROGRAM_FLASH0_mbc, base_region: {start: '0x00000000', size: '0x00100000'}, domains: [{security: s, template: Template_1}]}, {id: PROGRAM_FLASH1_mbc,
          base_region: {start: '0x00000000', size: '0x00100000'}, domains: [{security: s, template: Template_1}]}, {id: FlashBank_IFR0_mbc, base_region: {start: '0x00000000',
            size: '0x00010000'}, domains: [{security: s, template: Template_1}]}, {id: FlashBank_IFR1_mbc, base_region: {start: '0x00000000', size: '0x00004000'},
          domains: [{security: s, template: Template_1}]}]
- saus:
  - sau:
    - enabled: 'false'
    - all_non_secure: 'false'
    - generate_code_for_disabled_regions: 'false'
    - regions: [{index: '0', enabled: 'false', security: ns, start: '0x00000000', size: '0x00000020'}, {index: '1', enabled: 'false', security: ns, start: '0x00000000',
        size: '0x00000020'}, {index: '2', enabled: 'false', security: ns, start: '0x00000000', size: '0x00000020'}, {index: '3', enabled: 'false', security: ns, start: '0x00000000',
        size: '0x00000020'}, {index: '4', enabled: 'false', security: ns, start: '0x00000000', size: '0x00000020'}, {index: '5', enabled: 'false', security: ns, start: '0x00000000',
        size: '0x00000020'}, {index: '6', enabled: 'false', security: ns, start: '0x00000000', size: '0x00000020'}, {index: '7', enabled: 'false', security: ns, start: '0x00000000',
        size: '0x00000020'}]
- global_options:
  - no:
    - id: [_trigger_sources_, GPIO0_PCNS, GPIO0_ICNS, GPIO0_PCNP, GPIO0_ICNP, GPIO1_PCNS, GPIO1_ICNS, GPIO1_PCNP, GPIO1_ICNP, GPIO2_PCNS, GPIO2_ICNS, GPIO2_PCNP,
      GPIO2_ICNP, GPIO3_PCNS, GPIO3_ICNS, GPIO3_PCNP, GPIO3_ICNP, GPIO4_PCNS, GPIO4_ICNS, GPIO4_PCNP, GPIO4_ICNP, GPIO5_PCNS, GPIO5_ICNS, GPIO5_PCNP, GPIO5_ICNP,
      AIRCR_PRIS, AIRCR_BFHFNMINS, AIRCR_SYSRESETREQS, SCR_SLEEPDEEPS, SHCSR_SECUREFAULTENA, NSACR_CP2, NSACR_CP3, NSACR_CP4, NSACR_CP5, NSACR_CP6, NSACR_CP7, CPPWR_SU0,
      CPPWR_SUS0, CPPWR_SU1, CPPWR_SUS1, CPPWR_SU2, CPPWR_SUS2, CPPWR_SU3, CPPWR_SUS3, CPPWR_SU4, CPPWR_SUS4, CPPWR_SU5, CPPWR_SUS5, CPPWR_SU6, CPPWR_SUS6, CPPWR_SU7,
      CPPWR_SUS7, CPPWR_SU10, CPPWR_SUS10, CPPWR_SU11, CPPWR_SUS11, SEC_GPIO_MASK0_LOCK, SEC_GPIO_MASK1_LOCK, SEC_CPU1_INT_MASK0_LOCK, SEC_CPU1_INT_MASK1_LOCK, SEC_CPU1_INT_MASK2_LOCK,
      SEC_CPU1_INT_MASK3_LOCK, SEC_CPU1_INT_MASK4_LOCK, MASTER_SEC_LEVEL_LOCK, CPU0_LOCK_NS_VTOR, CPU0_LOCK_NS_MPU, CPU0_LOCK_S_VTAIRCR, CPU0_LOCK_S_MPU, CPU0_LOCK_SAU,
      CM33_LOCK_REG_LOCK, CPU1_LOCK_NS_VTOR, CPU1_LOCK_NS_MPU, AHB_MISC_CTRL_REG_IDAU_ALL_NS, AHB_MISC_CTRL_REG_DISABLE_VIOLATION_ABORT, AHB_MISC_CTRL_REG_ENABLE_NS_PRIV_CHECK,
      AHB_MISC_CTRL_REG_ENABLE_S_PRIV_CHECK, AHB_MISC_CTRL_REG_ENABLE_SECURE_CHECKING, AHB_MISC_CTRL_REG_WRITE_LOCK]
  - 3:
    - id: [CPACR_CP0, CPACR_CP1, CPACR_CP10, CPACR_CP11]
  - 0:
    - id: [CPACR_CP2, CPACR_CP3, CPACR_CP4, CPACR_CP5, CPACR_CP6, CPACR_CP7]
  - yes:
    - id: [NSACR_CP0, NSACR_CP1, NSACR_CP10, NSACR_CP11, AHB_MISC_CTRL_REG_DISABLE_MASTER_STRICT_MODE]
- user_memory_regions: []
- mpus:
  - mpu:
    - enabled: 'false'
    - id: 's'
    - priv_default_map: 'false'
    - handler_enabled: 'false'
    - generate_code_for_disabled_regions: 'false'
    - attributes: [{index: '0', id: '0', memory_type: device, device: nGnRE, regions_properties: [{id: inner, cacheable: 'false', write_back: 'false', read_allocation: 'false',
            write_allocation: 'false', transientness: 'false'}, {id: outer, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false',
            transientness: 'false'}]}, {index: '1', id: '1', memory_type: device, device: nGnRE, regions_properties: [{id: inner, cacheable: 'false', write_back: 'false',
            read_allocation: 'false', write_allocation: 'false', transientness: 'false'}, {id: outer, cacheable: 'false', write_back: 'false', read_allocation: 'false',
            write_allocation: 'false', transientness: 'false'}]}, {index: '2', id: '2', memory_type: device, device: nGnRE, regions_properties: [{id: inner, cacheable: 'false',
            write_back: 'false', read_allocation: 'false', write_allocation: 'false', transientness: 'false'}, {id: outer, cacheable: 'false', write_back: 'false',
            read_allocation: 'false', write_allocation: 'false', transientness: 'false'}]}, {index: '3', id: '3', memory_type: device, device: nGnRE, regions_properties: [
          {id: inner, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false', transientness: 'false'}, {id: outer, cacheable: 'false',
            write_back: 'false', read_allocation: 'false', write_allocation: 'false', transientness: 'false'}]}, {index: '4', id: '4', memory_type: device, device: nGnRE,
        regions_properties: [{id: inner, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false', transientness: 'false'}, {
            id: outer, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false', transientness: 'false'}]}, {index: '5', id: '5',
        memory_type: device, device: nGnRE, regions_properties: [{id: inner, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false',
            transientness: 'false'}, {id: outer, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false', transientness: 'false'}]},
      {index: '6', id: '6', memory_type: device, device: nGnRE, regions_properties: [{id: inner, cacheable: 'false', write_back: 'false', read_allocation: 'false',
            write_allocation: 'false', transientness: 'false'}, {id: outer, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false',
            transientness: 'false'}]}, {index: '7', id: '7', memory_type: device, device: nGnRE, regions_properties: [{id: inner, cacheable: 'false', write_back: 'false',
            read_allocation: 'false', write_allocation: 'false', transientness: 'false'}, {id: outer, cacheable: 'false', write_back: 'false', read_allocation: 'false',
            write_allocation: 'false', transientness: 'false'}]}]
    - regions: [{executable: 'false', read_only: 'false', shareability: non_shareable, attributes_index: '0', index: '0', enabled: 'false', security: priv, start: '0x00000000',
        size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable, attributes_index: '0', index: '1', enabled: 'false', security: priv,
        start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable, attributes_index: '0', index: '2', enabled: 'false',
        security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable, attributes_index: '0', index: '3',
        enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable, attributes_index: '0',
        index: '4', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable,
        attributes_index: '0', index: '5', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable,
        attributes_index: '0', index: '6', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable,
        attributes_index: '0', index: '7', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}]
  - mpu:
    - enabled: 'false'
    - id: 'ns'
    - priv_default_map: 'false'
    - handler_enabled: 'false'
    - generate_code_for_disabled_regions: 'false'
    - attributes: [{index: '0', id: '0', memory_type: device, device: nGnRE, regions_properties: [{id: inner, cacheable: 'false', write_back: 'false', read_allocation: 'false',
            write_allocation: 'false', transientness: 'false'}, {id: outer, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false',
            transientness: 'false'}]}, {index: '1', id: '1', memory_type: device, device: nGnRE, regions_properties: [{id: inner, cacheable: 'false', write_back: 'false',
            read_allocation: 'false', write_allocation: 'false', transientness: 'false'}, {id: outer, cacheable: 'false', write_back: 'false', read_allocation: 'false',
            write_allocation: 'false', transientness: 'false'}]}, {index: '2', id: '2', memory_type: device, device: nGnRE, regions_properties: [{id: inner, cacheable: 'false',
            write_back: 'false', read_allocation: 'false', write_allocation: 'false', transientness: 'false'}, {id: outer, cacheable: 'false', write_back: 'false',
            read_allocation: 'false', write_allocation: 'false', transientness: 'false'}]}, {index: '3', id: '3', memory_type: device, device: nGnRE, regions_properties: [
          {id: inner, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false', transientness: 'false'}, {id: outer, cacheable: 'false',
            write_back: 'false', read_allocation: 'false', write_allocation: 'false', transientness: 'false'}]}, {index: '4', id: '4', memory_type: device, device: nGnRE,
        regions_properties: [{id: inner, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false', transientness: 'false'}, {
            id: outer, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false', transientness: 'false'}]}, {index: '5', id: '5',
        memory_type: device, device: nGnRE, regions_properties: [{id: inner, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false',
            transientness: 'false'}, {id: outer, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false', transientness: 'false'}]},
      {index: '6', id: '6', memory_type: device, device: nGnRE, regions_properties: [{id: inner, cacheable: 'false', write_back: 'false', read_allocation: 'false',
            write_allocation: 'false', transientness: 'false'}, {id: outer, cacheable: 'false', write_back: 'false', read_allocation: 'false', write_allocation: 'false',
            transientness: 'false'}]}, {index: '7', id: '7', memory_type: device, device: nGnRE, regions_properties: [{id: inner, cacheable: 'false', write_back: 'false',
            read_allocation: 'false', write_allocation: 'false', transientness: 'false'}, {id: outer, cacheable: 'false', write_back: 'false', read_allocation: 'false',
            write_allocation: 'false', transientness: 'false'}]}]
    - regions: [{executable: 'false', read_only: 'false', shareability: non_shareable, attributes_index: '0', index: '0', enabled: 'false', security: priv, start: '0x00000000',
        size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable, attributes_index: '0', index: '1', enabled: 'false', security: priv,
        start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable, attributes_index: '0', index: '2', enabled: 'false',
        security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable, attributes_index: '0', index: '3',
        enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable, attributes_index: '0',
        index: '4', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable,
        attributes_index: '0', index: '5', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable,
